Repository: manaflow-ai/cmux
Catalog: TerminalScrollLab/Resources/Localizable.xcstrings
Source language: en
Languages: ja

# lab.title
source: Ghostty Native Scroll Lab
ja: Ghostty ネイティブスクロールラボ

# runtime.error.title
source: Ghostty could not start
ja: Ghostty を起動できませんでした

# scroll.audit.format
source: %@; %@; %@; target row %llu; rendered row %llu
ja: %@、%@、%@、目標行 %llu、描画行 %llu

# scroll.chrome.moved
source: Fixed chrome moved
ja: 固定 UI が移動

# scroll.chrome.stable
source: Fixed chrome stable
ja: 固定 UI は安定

# scroll.deceleration.not-observed
source: Deceleration not observed
ja: 減速未確認

# scroll.deceleration.observed
source: Deceleration observed
ja: 減速確認済み

# scroll.metrics.format
source: %@ offset %.1f / %.1f pt translation %.1f pt
ja: %@ オフセット %.1f / %.1f pt 移動 %.1f pt

# scroll.phase.decelerating
source: DECELERATING
ja: 減速中

# scroll.phase.dragging
source: DRAGGING
ja: ドラッグ中

# scroll.phase.idle
source: IDLE
ja: 待機中

# scroll.renderer.fractional-active
source: Fractional renderer active
ja: 端数ピクセル描画が有効

# scroll.renderer.fractional-inactive
source: Fractional renderer inactive
ja: 端数ピクセル描画が無効

# terminal.prompt
source: Drag and fling anywhere in the terminal.
ja: ターミナル内をドラッグまたはフリックしてください。

# terminal.row.format
source: Ghostty renderer row %03lld
ja: Ghostty レンダラー行 %03lld
